## Production: efs
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
outputs.tf
```
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_efs_mount_target.efs_mount will be created
  + resource "aws_efs_mount_target" "efs_mount" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-02e417f65f0b93510"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-033c29e939a74c39b",
        ]
      + subnet_id              = jsonencode(
            [
              + "subnet-066c6b13009cc761a",
              + "subnet-0f0e20195a44b2a73",
              + "subnet-04892391188217b74",
            ]
        )
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_efs_access_point = "arn:aws:elasticfilesystem:ca-central-1:414662622316:access-point/fsap-0f66b64c3791a5d33"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_efs_access_point.efs_access_point"]
WARN - plan.json - main - Missing Common Tags: ["aws_efs_file_system.generated_statement_efs"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
